# Pandas

### Pandas Serisi Oluşturmak

In [1]:
import pandas as pd

In [2]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

* x sütununda ki değerler bu serinin index bilgileridir. y sütunu ise seri içerisinde yer alan değerlerdir. Değerler index ifadeleri ile bir arada verilmiştir.

In [3]:
seri = pd.Series([1,2,3,4,5])

In [4]:
type(seri)

pandas.core.series.Series

In [5]:
seri.axes #serinin index bilgilerine erişiyoruz

[RangeIndex(start=0, stop=5, step=1)]

In [6]:
seri.dtype #tip sorgulama

dtype('int64')

In [7]:
seri.size #eleman sayısı

5

In [8]:
seri.ndim #boyut bilgisi

1

In [9]:
seri.values #sadece deger bilgisine erişmek

array([1, 2, 3, 4, 5])

In [10]:
seri.head() #serinin ilk 5 gözlemi (ön tanımlı değeri 5)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [11]:
seri.tail(3) #serinin belirtilen son elemanları

2    3
3    4
4    5
dtype: int64

In [12]:
#index isimlendirmesi

In [13]:
pd.Series([99,22,332,94,5], index = [1,3,5,7,9])

1     99
3     22
5    332
7     94
9      5
dtype: int64

In [14]:
pd.Series([99,22,332,94,5], index = ["a","b","c","d","e"])

a     99
b     22
c    332
d     94
e      5
dtype: int64

In [15]:
seri = pd.Series([99,22,332,94,5], index = ["a","b","c","d","e"])

In [16]:
seri["a"]

99

In [17]:
seri["a":"c"]

a     99
b     22
c    332
dtype: int64

In [18]:
#sozluk uzerinden liste olusturmak

In [19]:
sozluk = pd.Series({"reg":10, "log":11, "cart":12})
sozluk

reg     10
log     11
cart    12
dtype: int64

In [20]:
sozluk2 = {"reg":10, "log":11, "cart":12}
seri = pd.Series(sozluk2)
seri

reg     10
log     11
cart    12
dtype: int64

In [21]:
#iki seriyi birlestirerek seri olusturma

In [22]:
pd.concat([seri,seri])

reg     10
log     11
cart    12
reg     10
log     11
cart    12
dtype: int64

### Eleman İşlemleri

In [23]:
import numpy as np
a = np.array([1,2,33,444,75])
seri = pd.Series(a)
seri

0      1
1      2
2     33
3    444
4     75
dtype: int64

In [24]:
seri[0]

1

In [25]:
seri[0:3]

0     1
1     2
2    33
dtype: int64

In [26]:
seri = pd.Series([121,200,150,99], index = ["reg", "loj","cart","rf"])
seri

reg     121
loj     200
cart    150
rf       99
dtype: int64

In [27]:
seri.index #sadece index bilgilerine erismek

Index(['reg', 'loj', 'cart', 'rf'], dtype='object')

In [28]:
seri.keys

<bound method Series.keys of reg     121
loj     200
cart    150
rf       99
dtype: int64>

In [29]:
list(seri.items()) #her bir key degerine karsilik gelen degerleri veriyor

[('reg', 121), ('loj', 200), ('cart', 150), ('rf', 99)]

In [30]:
seri.values #seri degerlerine erismek

array([121, 200, 150,  99])

In [31]:
#eleman sorgulama

In [32]:
"reg" in seri #reg ifadesi seri içinde mi ?

True

In [33]:
"a" in seri

False

In [34]:
#fancy ile eleman sorgulama

In [35]:
seri[["rf", "reg"]]

rf      99
reg    121
dtype: int64

In [36]:
#farklı deger atama

In [37]:
seri["reg"] = 130
seri

reg     130
loj     200
cart    150
rf       99
dtype: int64

In [38]:
seri["reg":"loj"]

reg    130
loj    200
dtype: int64

### Pandas DataFrame Oluşturma

In [39]:
import pandas as pd
l = [1,2,39,67,90]
l

[1, 2, 39, 67, 90]

In [40]:
pd.DataFrame(l, columns = ["degisken_ismi"]) #tek degiskenli

   degisken_ismi
0              1
1              2
2             39
3             67
4             90

In [41]:
#iki degiskenli

In [42]:
import numpy as np
m = np.arange(1,10).reshape(3,3)
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [43]:
pd.DataFrame(m, columns = ["var1", "var2", "var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

* degisken isimlerini degistirmek istersek;

In [44]:
#df isimlendirme

In [45]:
df = pd.DataFrame(m, columns = ["var1", "var2", "var3"])
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [46]:
df.columns = ["deg1","deg2","deg3"]

In [47]:
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [48]:
#df ozelliklerine erismek

In [49]:
type(df)

pandas.core.frame.DataFrame

In [50]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [51]:
df.shape

(3, 3)

In [52]:
df.ndim

2

In [53]:
df.size

9

In [54]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [55]:
type(df.values)

numpy.ndarray

In [56]:
df.head()

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [57]:
df.tail()

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [58]:
a = np.array([1,2,3,4,5])
pd.DataFrame(a, columns = ["deg1"]) #numpy array üzerinden DataFrame

   deg1
0     1
1     2
2     3
3     4
4     5

### Pandas DataFrame Eleman İşlemleri

In [59]:
import numpy as np
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5) #numpy array'leri olusturduk

In [60]:
sozluk = {"var1": s1, "var2": s2, "var3": 3}
sozluk

{'var1': array([4, 2, 3, 6, 5]), 'var2': array([3, 7, 5, 0, 4]), 'var3': 3}

In [61]:
df = pd.DataFrame(sozluk)
df #sozluk uzerinden df olusturduk

   var1  var2  var3
0     4     3     3
1     2     7     3
2     3     5     3
3     6     0     3
4     5     4     3

In [62]:
df[0:1] #0'dan 1'e kadar

   var1  var2  var3
0     4     3     3

In [63]:
df.index = ["a","b","c","d","e"]
df

   var1  var2  var3
a     4     3     3
b     2     7     3
c     3     5     3
d     6     0     3
e     5     4     3

In [64]:
df["c":"e"]

   var1  var2  var3
c     3     5     3
d     6     0     3
e     5     4     3

In [65]:
df[2:4]

   var1  var2  var3
c     3     5     3
d     6     0     3

In [66]:
#silme islemi

In [67]:
df.drop("a", axis = 0) #axis = 0 satırlara göre

   var1  var2  var3
b     2     7     3
c     3     5     3
d     6     0     3
e     5     4     3

* bu islem ana df üzerinde bir degisiklik yapmaz. Ana df üzerinde kalıcı bir degisiklik yapmak istersek; **inplace** argümanını kullanmalıyız.

In [68]:
df.drop("a", axis = 0, inplace = True)
df

   var1  var2  var3
b     2     7     3
c     3     5     3
d     6     0     3
e     5     4     3

In [69]:
#fancy ile silme islemi

In [70]:
l = ["c", "e"]

In [71]:
df.drop(l, axis = 0)

   var1  var2  var3
b     2     7     3
d     6     0     3

In [72]:
#degiskenler icin

In [73]:
"var1" in df

True

In [74]:
l = ["var1", "var4", "var2"]

In [75]:
for i in l:
    print(i in df)

True
False
True

* df icerinde yer alan degiskenler üzerinden yeni bir degisken olusturmak isteyelim

In [76]:
df["var4"] = df["var1"] * df["var2"]
df

   var1  var2  var3  var4
b     2     7     3    14
c     3     5     3    15
d     6     0     3     0
e     5     4     3    20

In [77]:
#degisken silmek

In [78]:
df.drop("var4", axis = 1)

   var1  var2  var3
b     2     7     3
c     3     5     3
d     6     0     3
e     5     4     3

In [79]:
df

   var1  var2  var3  var4
b     2     7     3    14
c     3     5     3    15
d     6     0     3     0
e     5     4     3    20

In [80]:
df.drop("var4", axis = 1, inplace = True)

In [81]:
df

   var1  var2  var3
b     2     7     3
c     3     5     3
d     6     0     3
e     5     4     3

In [82]:
l = ["var1", "var2"]

In [83]:
df.drop(l, axis = 1) #fancy ile silme

   var3
b     3
c     3
d     3
e     3

### Gözlem ve Değişken Seçimi: loc & iloc

In [84]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0    13    15     9
1    15    13    21
2    16     7    11
3    13    18    29
4    25     6    28
5    12    21     5
6    29    25    27
7     3     9    14
8    24    14    11
9    21     5    13

* loc: tanımlandığı şekli ile seçim yapmak için kullanılır.

In [85]:
df.loc[0:3] #e kadar mantıgı burada yok

   var1  var2  var3
0    13    15     9
1    15    13    21
2    16     7    11
3    13    18    29

* iloc: alışık olduğumuz indeksleme mantığı ile seçim yapar.

In [86]:
df.iloc[0:3]

   var1  var2  var3
0    13    15     9
1    15    13    21
2    16     7    11

In [87]:
df.iloc[:3,:2]

   var1  var2
0    13    15
1    15    13
2    16     7

In [88]:
df.loc[0:3, "var3"]

0     9
1    21
2    11
3    29
Name: var3, dtype: int64

In [89]:
#degisken isimlerine göre seçme işlemi yapmak istersek, loc kullanmalıyız.
#peki iloc ile tek bir degiskeni getirmek istersek;

In [90]:
df.iloc[0:3]["var3"]

0     9
1    21
2    11
Name: var3, dtype: int64

* Özetle; eğer verilen kurallara bağlı bir seçim yapmak istiyorsak **loc** yapısı, eğer verilen isimlerden bağımsız klasik index mantığı ile seçim yapmak istersek **iloc** yapısı kullanılır.

### Koşullu Eleman İşlemleri

In [91]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0    10     7    16
1    13    12     4
2    13    21    21
3    18    19    17
4    24    28    23
5    17    28     3
6    27    26     1
7    29    11     6
8    20     1    19
9    13    28    25

In [92]:
df[0:2][["var1","var2"]]

   var1  var2
0    10     7
1    13    12

In [93]:
#birinci degişkendeki degerlerin 5'ten büyük olması durumunu gözlemleyelim;

In [94]:
df[df.var1 > 15]

   var1  var2  var3
3    18    19    17
4    24    28    23
5    17    28     3
6    27    26     1
7    29    11     6
8    20     1    19

In [95]:
#birden fazla koşul girmek istersek;

In [96]:
df[(df.var1 > 15) & (df.var3 < 15)]

   var1  var2  var3
5    17    28     3
6    27    26     1
7    29    11     6

In [97]:
df.loc[(df.var1 > 15), ["var1","var2"]]

   var1  var2
3    18    19
4    24    28
5    17    28
6    27    26
7    29    11
8    20     1

In [98]:
df[(df.var1 > 15)][["var1","var2"]]

   var1  var2
3    18    19
4    24    28
5    17    28
6    27    26
7    29    11
8    20     1

### Birleştirme (join) İşlemleri

In [99]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (5,3))
df1 = pd.DataFrame(m, columns = ["var1","var2","var3"])
df1

   var1  var2  var3
0    24     3     1
1     7     6    28
2    24    23    13
3    16    28    25
4    14    13     4

In [100]:
df2 = df + 99
df2

   var1  var2  var3
0   109   106   115
1   112   111   103
2   112   120   120
3   117   118   116
4   123   127   122
5   116   127   102
6   126   125   100
7   128   110   105
8   119   100   118
9   112   127   124

In [101]:
pd.concat([df1,df2])

   var1  var2  var3
0    24     3     1
1     7     6    28
2    24    23    13
3    16    28    25
4    14    13     4
0   109   106   115
1   112   111   103
2   112   120   120
3   117   118   116
4   123   127   122
5   116   127   102
6   126   125   100
7   128   110   105
8   119   100   118
9   112   127   124

* Burada oluşan index sorununun önüne geçmek için;

In [102]:
pd.concat([df1,df2], ignore_index = True)

    var1  var2  var3
0     24     3     1
1      7     6    28
2     24    23    13
3     16    28    25
4     14    13     4
5    109   106   115
6    112   111   103
7    112   120   120
8    117   118   116
9    123   127   122
10   116   127   102
11   126   125   100
12   128   110   105
13   119   100   118
14   112   127   124

In [103]:
df1.columns #degisken isimleri

Index(['var1', 'var2', 'var3'], dtype='object')

In [104]:
df2.columns = ["var1", "var2","deg3"]
df2

   var1  var2  deg3
0   109   106   115
1   112   111   103
2   112   120   120
3   117   118   116
4   123   127   122
5   116   127   102
6   126   125   100
7   128   110   105
8   119   100   118
9   112   127   124

In [105]:
df1

   var1  var2  var3
0    24     3     1
1     7     6    28
2    24    23    13
3    16    28    25
4    14    13     4

In [106]:
pd.concat([df1, df2],ignore_index = True)

    var1  var2  var3   deg3
0     24     3   1.0    NaN
1      7     6  28.0    NaN
2     24    23  13.0    NaN
3     16    28  25.0    NaN
4     14    13   4.0    NaN
5    109   106   NaN  115.0
6    112   111   NaN  103.0
7    112   120   NaN  120.0
8    117   118   NaN  116.0
9    123   127   NaN  122.0
10   116   127   NaN  102.0
11   126   125   NaN  100.0
12   128   110   NaN  105.0
13   119   100   NaN  118.0
14   112   127   NaN  124.0

* Burada yaşanan sorun df'lerin farklı bilgi taşımasıdır (var3 ve deg3)

In [107]:
pd.concat([df1,df2], join = "inner") #kesisimlerine göre birleştirdi

   var1  var2
0    24     3
1     7     6
2    24    23
3    16    28
4    14    13
0   109   106
1   112   111
2   112   120
3   117   118
4   123   127
5   116   127
6   126   125
7   128   110
8   119   100
9   112   127

* pd.concat([df1, df2], join_axes = [df1.columns],ignore_index = True)
sectigimiz degiskene göre birleştirme yapabiliriz.

### İleri Birleştirme İşlemleri

In [108]:
import pandas as pd

In [109]:
#birebir birleştirme (#üm elemanların iki veri setinde de yer alması durumudur.)

In [110]:
df1 = pd.DataFrame({"calisanlar": ["Ali","Veli","Ayse","Fatma"],
                   "grup": ["Muhasebe", "Muhendislik","Muhendislik","IK"]})

df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           IK

In [111]:
df2 = pd.DataFrame({"calisanlar": ["Ayse", "Ali", "Veli", "Fatma"],
                   "ilk_giris": [2010, 2009, 2014, 2019]})

df2

  calisanlar  ilk_giris
0       Ayse       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [112]:
pd.merge(df1, df2)

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           IK       2019

In [113]:
pd.merge(df1, df2, on = "calisanlar")

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           IK       2019

In [114]:
#coktan teke (many to one)

In [115]:
df3 = pd.merge(df1,df2)
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           IK       2019

In [116]:
df4 = pd.DataFrame({"grup": ["Muhasebe","Muhendislik", "IK"],
                   "mudur": ["Caner","Mustafa", "Berkcan"]})

df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           IK  Berkcan

In [117]:
pd.merge(df3, df4)

  calisanlar         grup  ilk_giris    mudur
0        Ali     Muhasebe       2009    Caner
1       Veli  Muhendislik       2014  Mustafa
2       Ayse  Muhendislik       2010  Mustafa
3      Fatma           IK       2019  Berkcan

In [118]:
#çoktan çoka (many to many)

In [119]:
df5 = pd.DataFrame({"grup": ["Muhasebe","Muhasebe",
                            "Muhendislik", "Muhendislik", "IK","IK"],
                    "yetenekler": ["Matematik", "excel", "kodlama", "linux",
                                  "excel","yonetim"]})

df5

          grup yetenekler
0     Muhasebe  Matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           IK      excel
5           IK    yonetim

In [120]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           IK

In [121]:
pd.merge(df1, df5)

  calisanlar         grup yetenekler
0        Ali     Muhasebe  Matematik
1        Ali     Muhasebe      excel
2       Veli  Muhendislik    kodlama
3       Veli  Muhendislik      linux
4       Ayse  Muhendislik    kodlama
5       Ayse  Muhendislik      linux
6      Fatma           IK      excel
7      Fatma           IK    yonetim

### Toplulaştırma ve Gruplama (Aggregation & Grouping)

Basit toplulaştırma fonksiyonları

* count()
* first()
* last()
* mean()
* median()
* min()
* max()
* std()
* var()
* sum()

In [122]:
import seaborn as sns

* **seaborn** içerisinden bir veri setini çağırma işlemi;

In [123]:
df = sns.load_dataset("planets")

In [124]:
df.head() #ilk 5 satırını gözlemleyelim

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [125]:
df.shape #1035 satır 6 değişken taşıyor

(1035, 6)

In [126]:
df.mean() #tüm veri setine uygular

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [127]:
df["mass"].mean() #belirlediğimiz değişkenin ortalamasını alır

2.6381605847953233

In [128]:
df["mass"].min() #minimum deger

0.0036

In [129]:
df["mass"].max() #maksimum deger

25.0

In [130]:
df.describe() #tüm tanımlayıcı istatistikleri bir arada görebiliriz.

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

* Tablonun transpozunu alırsak daha okunabilir bir hale gelecektir.

In [131]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [132]:
df.dropna().describe().T #veri setindeki eksik gözlemleri göz ardı edebiliriz.

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

### Gruplama İşlemleri

In [133]:
df = pd.DataFrame({"gruplar": ["A","B","C","A","B","C"],
                  "veri": [10,11,52,23,43,55]}, columns = ["gruplar", "veri"])

df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

* gruplama işlemi; veri setinde yer alan kategorik değişkenlerin gruplarının yakalanması ve bu gruplar üzerinde bazı işlemler yapılmasıdır.

In [134]:
df.groupby("gruplar")

In [135]:
df.groupby("gruplar").mean()

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [136]:
df.groupby("gruplar").sum()

         veri
gruplar
A          33
B          54
C         107

In [137]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [138]:
df.groupby("method")

In [139]:
df.groupby("method")["orbital_period"].mean() 
#method degiskenine göre grupladık ve gruba göre işlem yapacagımız degiskeni sectik.

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [140]:
df.groupby("method")["orbital_period"].describe() #toplu halde görelim.

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

### İleri Toplulaştırma İşlemleri

* Aggregate
* filter
* transform
* apply

In [141]:
import pandas as pd
df = pd.DataFrame({"gruplar": ["A","B","C","A","B","C"],
                  "degisken1": [10,23,33,22,11,99],
                  "degisken2":[100,253,333,262,111,969]},
                  columns = ["gruplar", "degisken1", "degisken2"])

df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

1) aggregate

In [142]:
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
A               16        181
B               17        182
C               66        651

In [143]:
df.groupby("gruplar").aggregate(["min",np.median, max])
#istediğimiz birden fazla istatistikleri görüntüleyebiliyoruz.

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10     16  22       100    181  262
B              11     17  23       111    182  253
C              33     66  99       333    651  969

In [144]:
#iki değişken için iki farklı istatistik hesaplamak isteyelim

In [145]:
df.groupby("gruplar").aggregate({"degisken1": "min","degisken2": "max"})

         degisken1  degisken2
gruplar
A               10        262
B               11        253
C               33        969

2) filter

* kendi tanımladığımız fonksiyonlarımızı filtreleme aracı olarak degiskenler üzerinde sorgulayacağız;

In [146]:
def filter_func(x):
    return x["degisken1"].std() > 9

In [147]:
df.groupby("gruplar").std()

         degisken1   degisken2
gruplar
A         8.485281  114.551299
B         8.485281  100.409163
C        46.669048  449.719913

In [148]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

3) transform

In [149]:
#veri setinin degişkenlerine bir dönüştürme işlemi yapmak istiyoruz ve bu işlemi kendimiz tanımlamak istiyoruz.

In [150]:
df["degisken1"]*9

0     90
1    207
2    297
3    198
4     99
5    891
Name: degisken1, dtype: int64

In [151]:
df_a = df.iloc[:,1:3] #kategorik degiskenleri çıkartıyoruz.

In [152]:
df_a.transform(lambda x: (x-x.mean()) / x.std()) #normalizasyon

   degisken1  degisken2
0  -0.687871  -0.738461
1  -0.299074  -0.263736
2   0.000000  -0.015514
3  -0.328982  -0.235811
4  -0.657963  -0.704331
5   1.973890   1.957853

4) apply

In [153]:
import pandas as pd
df = pd.DataFrame({ "degisken1": [10,23,33,22,11,99],
                  "degisken2":[100,253,333,262,111,969]},
                  columns = ["degisken1", "degisken2"])

df

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

* df degişkenleri üzerinde gezinme yeteneği olan ve toplulaştırma amacıyla kullanılabilen bir fonksiyondur.

In [154]:
df.apply(np.sum)

degisken1     198
degisken2    2028
dtype: int64

In [155]:
df.apply(np.mean)

degisken1     33.0
degisken2    338.0
dtype: float64

In [156]:
import pandas as pd
df = pd.DataFrame({"gruplar": ["A","B","C","A","B","C"],
                  "degisken1": [10,23,33,22,11,99],
                  "degisken2":[100,253,333,262,111,969]},
                  columns = ["gruplar", "degisken1", "degisken2"])

df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [157]:
df.groupby("gruplar").apply(np.sum)

        gruplar  degisken1  degisken2
gruplar
A            AA         32        362
B            BB         34        364
C            CC        132       1302

### Pivot Tablolar

In [158]:
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [159]:
#cinsiyete göre veri setini gruplayıp sağ kalma durumunu inceleyelim;

In [160]:
titanic.groupby("sex")["survived"].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [161]:
titanic.groupby("sex")[["survived"]].mean() #dataframe olmasını istersek;

        survived
sex
female  0.742038
male    0.188908

In [162]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

* !**unstack** argümanı tablonun okunmasını daha kolay hale getirir.

In [163]:
#pivot ile table

In [164]:
titanic.pivot_table("survived", index = "sex", columns = "class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [165]:
#age degiskenini 3 sınıflı degiskene cevirip bu degiskeni gruplandırarak boyut olarak ekleyelim

In [166]:
age = pd.cut(titanic["age"], [0, 18, 90])
age.head(10)
#age degiskenini 3 sınıflı kategorik degiskene donusturduk

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]

In [167]:
titanic.pivot_table("survived", ["sex",age], "class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

### Dış Kaynaklı Veri Okuma

In [168]:
import pandas as pd

In [169]:
#csv okuma
pd.read_csv("reading_data/ornekcsv.csv", sep = ";")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [170]:
#txt okuma
pd.read_csv("reading_data/duz_metin.txt")

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

In [171]:
#excel okuma
pd.read_excel("reading_data/ornekx.xlsx")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [172]:
df = pd.read_excel("reading_data/ornekx.xlsx")

In [173]:
type(df)

pandas.core.frame.DataFrame

In [174]:
df.head()

    a    b    c
0  78   12  1.0
1  78   12  2.0
2  78  324  3.0
3   7    2  4.0
4  88   23  5.0

In [175]:
df.columns = ("A","B","C")
df

      A    B     C
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [176]:
?sns.load_dataset

Signature: sns.load_dataset(name, cache=True, data_home=None, **kws)
Docstring:
Load an example dataset from the online repository (requires internet).

This function provides quick access to a small number of example datasets
that are useful for documenting seaborn or generating reproducible examples
for bug reports. It is not necessary for normal usage.

Note that some of the datasets have a small amount of preprocessing applied
to define a proper ordering for categorical variables.

Use :func:`get_dataset_names` to see a list of available datasets.

Parameters
----------
name : str
    Name of the dataset (``{name}.csv`` on
    https://github.com/mwaskom/seaborn-data).
cache : boolean, optional
    If True, try to load from the local cache first, and save to the cache
    if a download is required.
data_home : string, optional
    The directory in which to cache data; see :func:`get_data_home`.
kws : keys and values, optional
    Additional keyword arguments are passed to passed through to
    :func:`pandas.read_csv`.

Returns
-------
df : :class:`pandas.DataFrame`
    Tabular data, possibly with some preprocessing applied.
File:      ~/opt/anaconda3/lib/python3.8/site-packages/seaborn/utils.py
Type:      function